modules/common/src/test/resources/com/l7tech/common/resources/googleSpellRequestWithIssuerSerialSignature.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:GoogleSearch" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Header>
<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:Signature Id="Signature-29746373" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>

<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-4559126">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>ctcXapIj17C/OsjvvBNBBaREGzo=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
PjVsoGfFzWodavvQi510dHeJlZOkrqVwxAczSkUG5SVbNOtFBZ8du9l/7mgXNJvdXis4k/1KcLfs
DLdOA5FA6KQKL8V4+EGup3pKyUsvjgoFvnk9R66cNt4g7QfVWtbx5zWFbUtQt2C+GwtqRXV8u8Rj
nRENyfGJcPRKJcWVmNg=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-19823056">
<wsse:SecurityTokenReference wsu:Id="STRId-4158836" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:X509Data>
<ds:X509IssuerSerial>
<ds:X509IssuerName>C=US,CN=Service Provider</ds:X509IssuerName>

<ds:X509SerialNumber>1035922268</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature></wsse:Security>


</soapenv:Header>
   <soapenv:Body wsu:Id="id-4559126" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <urn:doSpellingSuggestion soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <key xsi:type="xsd:string">BpBHwABQFHJTcRtXlc0HpMNRiLS1KKPD</key>
         <phrase xsi:type="xsd:string">moorons</phrase>
      </urn:doSpellingSuggestion>
   </soapenv:Body>
</soapenv:Envelope>